tap "derailed/k9s"
tap "railwaycat/emacsmacport"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Securely manage AWS API credentials using AWS SSO
brew "aws-sso-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Simple terminal UI for git commands
brew "lazygit"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@22", link: true
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python package management tool
brew "poetry"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Tool to build, change, and version infrastructure
brew "terraform"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# YAMAMOTO Mitsuharu's Mac port of GNU Emacs
brew "railwaycat/emacsmacport/emacs-mac@29", args: ["with-starter", "without-modules"]
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Web browser
cask "firefox"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Team communication and collaboration software
cask "slack"
# Messaging app with a focus on speed and security
cask "telegram"
# Collaboration and diagramming tool
cask "whimsical"
# Video communication and virtual meeting platform
cask "zoom"
